<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"831cce01f3cfe5d76dc09dde63297c54c3a5ce66d2842f68f494f41bdd4e30da","plan_job_ref":"Job plan #5 at https://github.com/GSA/usnotify-ssb/actions/runs/4116485091","plan_hash":"363b41deabdb1c447de2117c34765b0fce581eaad4715b955fb5463c70ab9722","plan_text_format":"text","version":"1.31.1"} -->
Terraform plan for __production__
<details>
<summary>Plan: 12 to add, 1 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_user_policy_attachment.sms_broker_policies["sms_broker"] will be created
  + resource "aws_iam_user_policy_attachment" "sms_broker_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "ssb-sms-broker"
    }

  # module.broker_sms.cloudfoundry_app.ssb will be created
  + resource "cloudfoundry_app" "ssb" {
      + buildpack                  = "binary_buildpack"
      + command                    = "source .profile && ./cloud-service-broker serve"
      + disk_quota                 = 2048
      + enable_ssh                 = false
      + environment                = (sensitive value)
      + health_check_http_endpoint = (known after apply)
      + health_check_timeout       = (known after apply)
      + health_check_type          = "port"
      + id                         = (known after apply)
      + id_bg                      = (known after apply)
      + instances                  = 1
      + memory                     = 256
      + name                       = "ssb-sms"
      + path                       = "./app-ssb-sms.zip"
      + ports                      = (known after apply)
      + source_code_hash           = "wMWGB0dXHt21UE0Rli/uHopTmhN8QnrKCs7ZLlabvpQ="
      + space                      = "a022fabe-056c-4329-9d4f-3f7a67442d36"
      + stack                      = (known after apply)
      + stopped                    = false
      + strategy                   = "blue-green"
      + timeout                    = 60

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }

      + service_binding {
          + service_instance = (known after apply)
        }
    }

  # module.broker_sms.cloudfoundry_route.ssb_uri will be created
  + resource "cloudfoundry_route" "ssb_uri" {
      + domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
      + endpoint = (known after apply)
      + hostname = "ssb-sms-notify-management"
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "a022fabe-056c-4329-9d4f-3f7a67442d36"
    }

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-demo"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-sms-gsa-tts-benefits-studio-prototyping-notify-demo"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "0b28b133-9f7b-49f1-9f34-a179cbb2549f"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-management"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-sms-gsa-tts-benefits-studio-prototyping-notify-management"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "a022fabe-056c-4329-9d4f-3f7a67442d36"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-prod"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-sms-gsa-tts-benefits-studio-prototyping-notify-prod"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "4447d89a-9735-4d82-94e1-dc07713aa460"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_sms.cloudfoundry_service_instance.db will be created
  + resource "cloudfoundry_service_instance" "db" {
      + id                             = (known after apply)
      + name                           = "ssb-sms-db"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "4b9e5bb1-d0d3-4c24-8542-e377cbb85aed"
      + space                          = "a022fabe-056c-4329-9d4f-3f7a67442d36"
      + tags                           = [
          + "mysql",
        ]

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + update = "30m"
        }
    }

  # module.broker_sms.random_password.client_password will be created
  + resource "random_password" "client_password" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.broker_sms.random_uuid.client_username will be created
  + resource "random_uuid" "client_username" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.broker_smtp.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
      ~ enable_ssh                 = true -> false
        id                         = "9596f7be-7799-48de-b8c2-2a03f4add6bc"
        name                       = "ssb-smtp"
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sms_broker_policy.aws_iam_policy.policy will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "SMS broker policy (covers SNS, IAM)"
      + id          = (known after apply)
      + name        = "sms_broker"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sns:GetSMSAttributes",
                          + "sns:SetSMSAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "iam:CreateUser",
                          + "iam:DeleteUser",
                          + "iam:GetUser",
                          + "iam:CreateAccessKey",
                          + "iam:DeleteAccessKey",
                          + "iam:CreateRole",
                          + "iam:DeleteRole",
                          + "iam:GetRole",
                          + "iam:GetRolePolicy",
                          + "iam:PutRolePolicy",
                          + "iam:DeleteRolePolicy",
                          + "iam:GetUserPolicy",
                          + "iam:PutUserPolicy",
                          + "iam:DeleteUserPolicy",
                          + "iam:CreatePolicy",
                          + "iam:DeletePolicy",
                          + "iam:GetPolicy",
                          + "iam:AttachUserPolicy",
                          + "iam:DetachUserPolicy",
                          + "iam:List*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.ssb-sms-broker-user.aws_iam_access_key.this_no_pgp[0] will be created
  + resource "aws_iam_access_key" "this_no_pgp" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "ssb-sms-broker"
    }

  # module.ssb-sms-broker-user.aws_iam_user.this[0] will be created
  + resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = true
      + id            = (known after apply)
      + name          = "ssb-sms-broker"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

Plan: 12 to add, 1 to change, 0 to destroy.
```
</details>

:x: Plan not applied in [apply #6](https://github.com/GSA/usnotify-ssb/actions/runs/4177905191) (Plan has changed)